Register.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:elep="http://www.ElephantTalk.es">
   <soapenv:Header>
      <elep:ETSoapHeader>
         <elep:IsEncrypted>0</elep:IsEncrypted>
         <!--Optional:-->
         <elep:Token>?</elep:Token>
      </elep:ETSoapHeader>
   </soapenv:Header>
   <soapenv:Body>
      <elep:Register>
         <!--Optional:-->
         <elep:msisdn>31632280021</elep:msisdn>
         <!--Optional:-->
         <elep:iccId>893105039090090148</elep:iccId>
         <elep:packageId>1610000001</elep:packageId>
         <elep:paymentType>Prepayment</elep:paymentType>
         <elep:dealerId>351001</elep:dealerId>
         <!--Optional:-->
         <elep:firstName>wang</elep:firstName>
         <!--Optional:-->
         <elep:middleName>hong</elep:middleName>
         <!--Optional:-->
         <elep:lastName>mei</elep:lastName>
         <elep:genderId>1</elep:genderId>
         <elep:birthday>2001-01-01</elep:birthday>
         <!--Optional:-->
         <elep:city>gz</elep:city>
         <!--Optional:-->
         <elep:address>tianhe</elep:address>
         <!--Optional:-->
         <elep:houseNo>?</elep:houseNo>
         <!--Optional:-->
         <elep:block>424</elep:block>
         <!--Optional:-->
         <elep:portal>3</elep:portal>
         <!--Optional:-->
         <elep:stair>3</elep:stair>
         <!--Optional:-->
         <elep:door>3</elep:door>
         <!--Optional:-->
         <elep:zipcode>34</elep:zipcode>
         <!--Optional:-->
         <elep:email>amay.wang@elephanttalk.com</elep:email>
         <!--Optional:-->
         <elep:telephone>2355</elep:telephone>
         <!--Optional:-->
         <elep:fax>?</elep:fax>
         <!--Optional:-->
         <elep:jobTitle>?</elep:jobTitle>
         <elep:nationalityId>4</elep:nationalityId>
         <elep:countryId>4</elep:countryId>
         <elep:provinceId>6</elep:provinceId>
         <elep:idTypeId>1</elep:idTypeId>
         <!--Optional:-->
         <elep:idNumber>?</elep:idNumber>
         <elep:languageId>1033</elep:languageId>
         <!--Optional:-->
         <elep:password>0000</elep:password>
         <!--Optional:-->
         <elep:bankCode>?</elep:bankCode>
         <!--Optional:-->
         <elep:bankName>23423</elep:bankName>
         <!--Optional:-->
         <elep:bankNumber>df</elep:bankNumber>
         <!--Optional:-->
         <elep:bankOwner>dgd</elep:bankOwner>
         <!--Optional:-->
         <elep:bankCity>gz</elep:bankCity>
         <!--Optional:-->
         <elep:referenceCode></elep:referenceCode>
         <!--Optional:-->
         <elep:comments>?</elep:comments>
         <!--Optional:-->
         <elep:user>14</elep:user>
         <!--Optional:-->
         <elep:userPassword>admin</elep:userPassword>
         <!--Optional:-->
         <elep:vmo>1</elep:vmo>
      </elep:Register>
   </soapenv:Body>
</soapenv:Envelope>